python-course/part2_2.html
<!doctype html>
<html lang="en">
<head>
<title>Baustein 2 Meeting 2</title>
<!-- 2020-05-06 Wed 22:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Falco Winkler">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
<link rel="stylesheet" type="text/css" href="css/python_course.css">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Baustein 2 Meeting 2</h1>
<p>
Thema der heutigen Einheit sind hauptsächlich <i>Bibliotheken</i>.
Bibliotheken sind im Kern von anderen Entwicklern bereitgestellte Funktionen und Klassen,
die es uns erlauben, vorgefertigte Implementierungen zu nutzen und so umfangreiche Programme zu schreiben.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Dateien lesen und schreiben</h2>
<div class="outline-text-2" id="text-1">
<p>
Bisher wurden alle Daten in unseren Programmen gelöscht, sobald das Programm beendet wurde. (Nur die Konsolenausgabe bleibt noch eine Weile da). Um Daten zu persistieren oder einfach Informationen aus einer Datei zu lesen, gibt es in Python eine Built-In Funktion <code>open</code>.
Diese Funktion liefert eine Referenz auf eure Datei. Ihr könnt eine Datei im Modus w für 'write', a für 'append', und r für read öffnen.
Es ist dabei wichtig, eine Datei nach Verwendung immer mit <code>close</code> zu schließen. Sonst kann es zu Problemen kommen wenn die Datei erneut geöffnet wird, und es werden Ressourcen verschwendet.
Die Methode write fügt keinen Zeilenumbruch ein, wie ihr das von <code>print</code> gewohnt seid. Ein Zeilenumbruch muss mit der sog. Escape-Sequenz <code>\n</code> manuell hinzugefügt werden.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Schreiben in eine Datei</span>

<span style="color: #7590db;">file_object</span> = <span style="color: #4f97d7;">open</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"kundendaten.txt"</span>, <span style="color: #2d9574;">"w"</span><span style="color: #4f97d7;">)</span>
file_object.write<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Herr Meier, 42, Angestellt\nHerr M&#252;ller, 32, Selbstst&#228;ndig"</span><span style="color: #4f97d7;">)</span>
file_object.close<span style="color: #4f97d7;">()</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Lesen einer Datei</span>
<span style="color: #7590db;">file_object</span> = <span style="color: #4f97d7;">open</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"kundendaten.txt"</span>, <span style="color: #2d9574;">"r"</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">read-mode</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Zeile f&#252;r zeile in einer Schleife</span>
<span style="color: #4f97d7; font-weight: bold;">for</span> line <span style="color: #4f97d7; font-weight: bold;">in</span> file_object:
    <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>line<span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Die Referenz sollte geschlossen werden, damit andere Programme</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Wissen, dass wir die Datei nicht mehr brauchen</span>
file_object.close<span style="color: #4f97d7;">()</span>
</pre>
</div>

<p>
Dieser Code erzeugt genau <a href="https://falcowinkler.github.io/org/kundendaten.txt">diese Datei.</a>
Die Sache mit dem close könnt ihr euch mit dem <code>with</code> Schlüsselwort einfacher machen. Dieses definiert einen Codeblock, nach dessen Ausführung die geöffnete Datei immer geschlossen wird.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">with</span> <span style="color: #4f97d7;">open</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"kundendaten.txt"</span>, <span style="color: #2d9574;">"r"</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">as</span> file_object, <span style="color: #4f97d7;">open</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"ausgabe.txt"</span>, <span style="color: #2d9574;">"w"</span><span style="color: #4f97d7;">)</span> <span style="color: #4f97d7; font-weight: bold;">as</span> out:
    <span style="color: #4f97d7; font-weight: bold;">for</span> line <span style="color: #4f97d7; font-weight: bold;">in</span> file_object:
        <span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>line<span style="color: #4f97d7;">)</span>
        out.write<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"!!!"</span> + line<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">close nicht ben&#246;tigt</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Übungen (Dateien)</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Dateien zusammenführen</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Wir wollen ein kleines Programm schreiben, welches alle Zeilen aus einer Datei A an eine andere Datei B anhängt. Dazu müsst ihr Folgendes, der Reihe nach, tun:
</p>
<ul class="org-ul">
<li>Datei A lesend öffnen (<code>open("meine_datei_A.txt", "r")</code>)
</li>
<li>Datei B im Anhänge-Modus öffnen (<code>open("meine_datei_B.txt", "a")</code>)
</li>
<li>Datei A Zeile für Zeile durchlaufen, und jede Zeile mit <code>write</code> in Datei b schreiben.
</li>
</ul>
<p>
(<a href="https://falcowinkler.github.io/resources/python-course/kurs_2_2_files1.py">Lösung</a>)
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Wörter zählen</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Schreibt ein Programm welches die Wörter in einer Datei zählt.
</li>
</ul>
<p>
(<a href="https://falcowinkler.github.io/resources/python-course/kurs_2_2_files2.py">Lösung</a>)
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Bibliotheken</h2>
<div class="outline-text-2" id="text-3">
<p>
Funktionen und Klassen können in eine sogenannte Bibliothek "verpackt" und so wiederverwendbar gemacht werden. Andere Entwickler können diese Bibliotheken dann über den Befehl import verwenden. In Python sind schon einige Bibliotheken vorinstalliert: Sie Enthalten Funktionalität die häufig gebraucht wird, wie zum Beispiel das Rechnen mit Datumswerten und Zeiten, Mathematische Funktionen, Interaktion mit dem Betriebssystem und so weiter. Auch die bisher kennengelerten Built-in Funtionen wie str oder input zählen zu dieser standard - Bibliothek. Eine Übersicht gibt es hier: <a href="https://docs.python.org/3/library/">https://docs.python.org/3/library/</a>
Wir werden heute beispielhaft die Bibliotheken math, random und time kennenlernen.
</p>
</div>
<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> math</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In dieser Bibliothek findet man alle wichtige mathematische Funktionen. Die braucht man in Computerprogrammen vielleicht häufiger als man denken mag.
Durch den Befehl import math können wir in der Syntax math.&lt;funktion&gt; auf alle Funktionen zugreifen. Will man sich das math. vorneweg sparen, kann man auch from math import * schreiben.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> math

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>math.pi<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">from</span> math <span style="color: #4f97d7; font-weight: bold;">import</span> *

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>pi<span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">radius</span> = <span style="color: #a45bad;">20</span>
<span style="color: #7590db;">umfang</span> = radius * <span style="color: #a45bad;">2</span> * pi
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>umfang<span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>log<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">1</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Logarithmus und Exponentialfunktion</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>log<span style="color: #bc6ec5;">(</span>exp<span style="color: #2d9574;">(</span><span style="color: #a45bad;">7</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>gcd<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">8</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Gr&#246;&#223;ter gemeinsamer teiler</span>

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>sqrt<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Wurzel</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>sqrt<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">9</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Die Funktionen in dieser Bibliothek benötigt man wenn man z.B. eine bestimmte Formel explizit ausrechnen muss.
Bzgl. der Funktion Sinus gibt es den folgenden Zusammenhang.
</p>
\begin{align}
sin(\frac{\pi} {4}) = \frac{\sqrt(2)}{2}
\end{align}
<p>
Angenommen wir wollen Prüfen ob diese Gleicheit stimmt.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">from</span> math <span style="color: #4f97d7; font-weight: bold;">import</span> *
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>cos<span style="color: #bc6ec5;">(</span>pi<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">cosinus</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>sin<span style="color: #bc6ec5;">(</span>pi<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">sinus (eigentlich 0, Ungenauigkeit in der Berechnung)</span>

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>sin<span style="color: #bc6ec5;">(</span>pi/<span style="color: #a45bad;">4</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>sqrt<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>/<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>sin<span style="color: #bc6ec5;">(</span>pi/<span style="color: #a45bad;">4</span><span style="color: #bc6ec5;">)</span> == sqrt<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span>/<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>isclose<span style="color: #bc6ec5;">(</span>sin<span style="color: #2d9574;">(</span>pi/<span style="color: #a45bad;">4</span><span style="color: #2d9574;">)</span>, sqrt<span style="color: #2d9574;">(</span><span style="color: #a45bad;">2</span><span style="color: #2d9574;">)</span>/<span style="color: #a45bad;">2</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
Warum ergibt der direkte Vergleich mit <code>==</code> <code>False</code>?
Der Grund liegt wieder in der Ungenauigkeit von Fließkommazahlen in Computern. Ihr erinnert euch eventell:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">1</span> + <span style="color: #a45bad;">0</span>.<span style="color: #a45bad;">2</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
0.3
</pre>


<p>
Die <code>math</code> Bibliothek achtet nicht auf solche Rundungen.
Mit <code>math.isclose(a,b)</code> kann man aber zum Beispiel zwei Zahlen auf Gleichheit prüfen, auch wenn sie ein bisschen verschieden sind.
</p>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> time</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Diese Bibliothek kann für das Umgehen mit Zeitintervallen, oder einfach dafür das aktuelle Jahr, den aktuellen Tag usw. rauszufinden (mit <code>gmttime</code>). Man kann auch die Zeit messen, die euer Programm zur Ausführung braucht.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> time

<span style="color: #4f97d7; font-weight: bold;">print</span> <span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"Sekunden seit 1970 : "</span> + <span style="color: #4f97d7;">str</span><span style="color: #bc6ec5;">(</span>time.time<span style="color: #2d9574;">()</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #2aa1ae; background-color: #292e34;">#</span><span style="color: #2aa1ae; background-color: #292e34;">Zeitattribute:</span>
<span style="color: #7590db;">zeitattribute</span> = time.gmtime<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>zeitattribute.tm_wday<span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Wochentag 1, = dienstag, 2 2= mittwoch</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>zeitattribute<span style="color: #4f97d7;">)</span>
<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">So kann man zum beispiel die Zeit messen</span>
<span style="color: #7590db;">vorher</span> = time.time<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7;">sum</span> = <span style="color: #a45bad;">0</span>
<span style="color: #4f97d7; font-weight: bold;">for</span> i <span style="color: #4f97d7; font-weight: bold;">in</span> <span style="color: #4f97d7;">range</span><span style="color: #4f97d7;">(</span><span style="color: #a45bad;">1000000</span><span style="color: #4f97d7;">)</span>:
    <span style="color: #4f97d7;">sum</span> += -<span style="color: #a45bad;">1</span> * i

<span style="color: #7590db;">nachher</span> = time.time<span style="color: #4f97d7;">()</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>nachher-vorher<span style="color: #4f97d7;">)</span>


<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Mit strptime kann man aus einem String ein Datum machen</span>
<span style="color: #7590db;">birthday</span> = time.strptime<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"19.08.95"</span>, <span style="color: #2d9574;">"%d.%m.%y"</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>birthday.tm_wday<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
Sekunden seit 1970 : 1588795268.41
2
time.struct_time(tm_year=2020, tm_mon=5, tm_mday=6, tm_hour=20, tm_min=1, tm_sec=8, tm_wday=2, tm_yday=127, tm_isdst=0)
0.112180948257
5
</pre>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Übung</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Schreibt eine Funktion <code>get_weekday</code> die ein Datum im üblichen europäischen Format (z.B. "01.02.2013") (das Format dafür ist <code>"%d.%m.%Y"</code>, grosses <code>Y</code>) entgegennimmt, und den Wochentag dafür als Zahl zurückgibt. Wenn noch Zeit ist, erweitert dann die Funktion damit sie den Wochentag als Zeichenkette zurückgibt ("Mittwoch" zum Beispiel)
Wer schon früher fertig ist: Schreibt eine Funktion, die euch die Anzahl an Tagen von jetzt bis zu einem gegebenen Datum liefert.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> time

<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_weekday</span><span style="color: #4f97d7;">(</span>date_as_string<span style="color: #4f97d7;">)</span>:
    ...
    <span style="color: #4f97d7; font-weight: bold;">return</span> ...
</pre>
</div>

<p>
(<a href="https://falcowinkler.github.io/resources/python-course/kurs_2_2_time.py">Lösung</a>)
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> random</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Mit <code>random</code> kann man zufällige Zahlen erzeugen. Außerdem gibt es noch einige Funktionen für Listen, die ein zufälliges Element zurückgeben oder die Elemente zufällig neu anordnen.
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> random

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>random.randint<span style="color: #bc6ec5;">(</span><span style="color: #a45bad;">0</span>,<span style="color: #a45bad;">8</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Zuf&#228;llige Zahl im Bereich 0 bis 8</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>random.random<span style="color: #bc6ec5;">()</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Zuf&#228;llige Kommazahl im bereich 0 - 1</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>random.random<span style="color: #bc6ec5;">()</span> * <span style="color: #a45bad;">10</span> + <span style="color: #a45bad;">20</span><span style="color: #4f97d7;">)</span> <span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Zuf&#228;llige Kommazahl im bereich 20-30</span>

<span style="color: #2aa1ae; background-color: #292e34;"># </span><span style="color: #2aa1ae; background-color: #292e34;">Welches kleid heute? ;)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>random.choice<span style="color: #bc6ec5;">(</span><span style="color: #2d9574;">[</span><span style="color: #2d9574;">"Das rote"</span>, <span style="color: #2d9574;">"Das blaue"</span>, <span style="color: #2d9574;">"Das gr&#252;ne"</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">sortiert</span> = <span style="color: #4f97d7;">[</span><span style="color: #a45bad;">1</span>, <span style="color: #a45bad;">2</span>, <span style="color: #a45bad;">3</span>, <span style="color: #a45bad;">4</span>, <span style="color: #a45bad;">5</span>, <span style="color: #a45bad;">6</span><span style="color: #4f97d7;">]</span>
random.shuffle<span style="color: #4f97d7;">(</span>sortiert<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>sortiert<span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>

<div id="outline-container-sec-3-3-1" class="outline-4">
<h4 id="sec-3-3-1"><span class="section-number-4">3.3.1</span> Übung</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Wir schreiben eine Funktion, die einen Satz als parameter bekommt, und die Reihenfolge der Wörter zufällig verändert.
Der veränderte Satz wird als String zurückgegeben.
</p>

<p>
Zur Erinnerung:
</p>
<ul class="org-ul">
<li><code>string.split("trennzeichen")</code> spaltet einen String in Teile
</li>
<li><code>"trennzeichen".join(liste)</code> fügt eine Liste aus strings wieder zusammen, mit dem Trennzeichen dazwischen.
</li>
</ul>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">randomize_sentence</span><span style="color: #4f97d7;">(</span>sentence<span style="color: #4f97d7;">)</span>:
    ...
</pre>
</div>
</div>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Dateien lesen und schreiben</a></li>
<li><a href="#sec-2">2. Übungen (Dateien)</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. Dateien zusammenführen</a></li>
<li><a href="#sec-2-2">2.2. Wörter zählen</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Bibliotheken</a>
<ul class="nav">
<li><a href="#sec-3-1">3.1. math</a></li>
<li><a href="#sec-3-2">3.2. time</a></li>
<li><a href="#sec-3-3">3.3. random</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
